Revit 2027 API
EnergyAnalysisConstruction.IsSchematic Property
 Indicates if this originates from a schematic or analytical construction.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsSchematic { get; }
Public ReadOnly Property IsSchematic As Boolean
	Get
public:
property bool IsSchematic {
	bool get ();
}
member IsSchematic : bool with get
Property Value
Boolean
See Also
Reference
EnergyAnalysisConstruction Class
Autodesk.Revit.DB.Analysis Namespace